Updated Project README
